/**
 * @file jljpg.h
 *
 * @brief JPG模块驱动
 * 注意：本文件时直接配置寄存器的驱动API，不建议直接调用，芯片迭代时本文件会跟随硬件修改
 *
 * @author JIELI TECHNOLOGY ZHUHAI
 *
 * @version V1.0.0
 *
 * @date 2025-06-05
 */
/* Copyright(C) 2010- , JIELI TECHNOLOGY, Inc.
 * All right reserved.
 */

#ifndef __JLJPG_H__
#define __JLJPG_H__


struct file_addr {
    u32 addr: 16;
    u32 len: 16;
};

// 杰理UI资源打包工具打包的jpg图片信息
struct jljpeg_head {
    u32 has_rgb_qtab: 1;
    u32 has_alpha_qtab: 1;
    u32 reserved: 30;
    struct file_addr file_info[3]; // 0:reorder.bin, 1:qtab.bin, 2:a_qtab.bin
};


/* ------------------------------------------------------------------------------------*/
/**
 * @brief jpg_get_state 获取 jpg 解码器状态
 *
 * @return 0 空闲，1 繁忙
 */
/* ------------------------------------------------------------------------------------*/
int jpg_get_state();

/* ------------------------------------------------------------------------------------*/
/**
 * @brief jpg_get_default_huffman_tab 获取默认 huffman 表地址
 *
 * @return 默认 huffman 表地址
 */
/* ------------------------------------------------------------------------------------*/
u16 *jpg_get_default_huffman_tab();

/* ------------------------------------------------------------------------------------*/
/**
 * @brief jpg_get_default_yuv_qtab 获取默认 yuv Q 表地址
 *
 * @return 默认 yuv 的Q表地址
 */
/* ------------------------------------------------------------------------------------*/
s16 *jpg_get_default_yuv_qtab();

/* ------------------------------------------------------------------------------------*/
/**
 * @brief jpg_get_default_alpha_qtab 获取默认 alpha Q 表地址
 *
 * @return 默认 alpha 的Q表地址
 */
/* ------------------------------------------------------------------------------------*/
s16 *jpg_get_default_alpha_qtab();

/* ------------------------------------------------------------------------------------*/
/**
 * @brief jpg_load_huffman_tab 加载 huffman 表到 jpg 解码器
 *
 * 注意：jpg_dec_init 时会调用本接口加载默认 huffman 表到解码器，一般情况下 huffman 表
 * 不需要更新，使用默认即可。必要时可以设置新的 huffman 表到解码器。
 *
 * @Params Huff huffman 表地址
 *
 * @return 0 成功，-1 失败
 */
/* ------------------------------------------------------------------------------------*/
int jpg_load_huffman_tab(u16 *Huff);

/* ------------------------------------------------------------------------------------*/
/**
 * @brief jpg_load_quant_tab 加载 Q 表到 jpg_get 解码器
 *
 * 注意：jpg_dec_init 时会调用本接口加载默认 Q 表到解码器，如果所有 jpg 图片采用相同压缩
 * 质量时，可以采用默认质量压缩，解码过程中不需要重新加载Q 表，部分 jpg 图片需采用不同压
 * 缩质量时可以更新Q 表再启动解码。
 *
 * @Params Qtab_yuv yuv Q表
 * @Params Qtab_a alpha Q表
 *
 * @return 0 成功，-1 失败
 */
/* ------------------------------------------------------------------------------------*/
int jpg_load_quant_tab(s16 *Qtab_yuv, s16 *Qtab_a);

/* ------------------------------------------------------------------------------------*/
/**
 * @brief jpg_clk_set 设置jpg解码器时钟
 *
 * @Params source 时钟源选择[1 hsb, 2 pat, 3 std_48M, 4 pll_96M]
 * @Params div_1 一级分频[0 div1, 1 div3, 2 div5, 3 div7]
 * @Params div_2 二级分频[0 div1, 1 div2, 2 div4, 3 div8]
 * @Params en 时钟使能[0 关闭，1 打开]
 * @Params rst 复位时钟[0 关闭，1 打开]
 *
 * @return 0 成功，-1 失败
 */
/* ------------------------------------------------------------------------------------*/
int jpg_clk_set(u8 source, u8 div_1, u8 div_2, u8 en, u8 rst);

/* ------------------------------------------------------------------------------------*/
/**
 * @brief jpg_dec_init jpg 解码器初始化
 *
 * @return 0 成功，1 失败
 */
/* ------------------------------------------------------------------------------------*/
int jpg_dec_init();


/* ------------------------------------------------------------------------------------*/
/**
 * @brief jpg_dump_jljpg_info 打印杰理打包工具打包的jpg图片信息
 *
 * @Params jpg_addr
 */
/* ------------------------------------------------------------------------------------*/
void jpg_dump_jljpg_info(u32 jpg_addr);


#endif


